In [1]:
import pandas as pd
import numpy as np

In [2]:
veri=np.random.randn(4,4)

In [3]:
veri

array([[ 0.83913939, -0.37663326, -0.56849241,  0.25955603],
       [-1.54465288,  0.18643491,  1.24404929, -0.60097735],
       [ 0.03457872, -1.79562253, -1.69431624, -0.0967294 ],
       [ 0.54891589,  1.26204876,  0.6977634 ,  1.05865227]])

In [4]:
veriDataFrame=pd.DataFrame(veri,index=["1.S","2.S","3.S","4.S"],columns=["1.K","2.K","3.K","4.K"])

In [5]:
veriDataFrame

          1.K       2.K       3.K       4.K
1.S  0.839139 -0.376633 -0.568492  0.259556
2.S -1.544653  0.186435  1.244049 -0.600977
3.S  0.034579 -1.795623 -1.694316 -0.096729
4.S  0.548916  1.262049  0.697763  1.058652

In [6]:
veriDataFrame.reset_index()

  index       1.K       2.K       3.K       4.K
0   1.S  0.839139 -0.376633 -0.568492  0.259556
1   2.S -1.544653  0.186435  1.244049 -0.600977
2   3.S  0.034579 -1.795623 -1.694316 -0.096729
3   4.S  0.548916  1.262049  0.697763  1.058652

In [7]:
veriDataFrame

          1.K       2.K       3.K       4.K
1.S  0.839139 -0.376633 -0.568492  0.259556
2.S -1.544653  0.186435  1.244049 -0.600977
3.S  0.034579 -1.795623 -1.694316 -0.096729
4.S  0.548916  1.262049  0.697763  1.058652

In [8]:
adlar={"isim":["Ali","Ahmet","Mehmet","Zeynep","Nalan"],
        "Yaslar":[25,54,12,63,24]
      }

In [9]:
sozlukDataFrame=pd.DataFrame(adlar)

In [10]:
sozlukDataFrame

     isim  Yaslar
0     Ali      25
1   Ahmet      54
2  Mehmet      12
3  Zeynep      63
4   Nalan      24

In [11]:
sozlukDataFrame.reset_index()

   index    isim  Yaslar
0      0     Ali      25
1      1   Ahmet      54
2      2  Mehmet      12
3      3  Zeynep      63
4      4   Nalan      24

In [12]:
sozlukDataFrame

     isim  Yaslar
0     Ali      25
1   Ahmet      54
2  Mehmet      12
3  Zeynep      63
4   Nalan      24

In [13]:
yeniIndexListesi=["1.kişi","2.kişi","3.kişi","4.kişi","5.kişi"]
sozlukDataFrame["İndex"]=yeniIndexListesi

In [14]:
sozlukDataFrame

     isim  Yaslar   İndex
0     Ali      25  1.kişi
1   Ahmet      54  2.kişi
2  Mehmet      12  3.kişi
3  Zeynep      63  4.kişi
4   Nalan      24  5.kişi

In [15]:
sozlukDataFrame.set_index("İndex",inplace=True)

In [16]:
sozlukDataFrame

          isim  Yaslar
İndex
1.kişi     Ali      25
2.kişi   Ahmet      54
3.kişi  Mehmet      12
4.kişi  Zeynep      63
5.kişi   Nalan      24

In [17]:
sinavlar={"1.sınav":[55,78,10],"2.sınav":[96,45,5]}
sinavlarDataFrame=pd.DataFrame(sinavlar,index=["1.not","2.not","eknot"])

In [18]:
sinavlarDataFrame

       1.sınav  2.sınav
1.not       55       96
2.not       78       45
eknot       10        5

In [19]:

yeniVeri=["n1","n2","ek"]
sinavlarDataFrame["kısaltma"]=yeniVeri

In [20]:
sinavlarDataFrame.set_index("kısaltma")

          1.sınav  2.sınav
kısaltma
n1             55       96
n2             78       45
ek             10        5

##

## Multi İndeks

In [21]:
## İlk önce en dış indeksi oluşturduk.

ilkIndeksler=["Simpson","Simpson","Simpson","South Park","South Park","South Park"]

In [22]:
icIndeksler=["Hamer","Bart","Marge","Cartman","Kenny","Kyle"]

In [23]:
birlesmisIndeks=list(zip(ilkIndeksler,icIndeksler))

In [24]:
birlesmisIndeks

[('Simpson', 'Hamer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [25]:
type(birlesmisIndeks)

list

In [26]:
birlesmisIndeks=pd.MultiIndex.from_tuples(birlesmisIndeks)

In [27]:
birlesmisIndeks

MultiIndex([(   'Simpson',   'Hamer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [28]:
cizgiFilm=[[40,"A"],[10,"B"],[30,"C"],[9,"D"],[10,"E"],[11,"F"]]
cizgiFilmNupmyDizisi=np.array(cizgiFilm)

In [29]:
cizgiFilmDataFrame=pd.DataFrame(cizgiFilmNupmyDizisi,index=birlesmisIndeks,columns=["Yas","Meslek"])

In [30]:
cizgiFilmDataFrame

                   Yas Meslek
Simpson    Hamer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [31]:
cizgiFilmDataFrame.loc["Simpson"]

      Yas Meslek
Hamer  40      A
Bart   10      B
Marge  30      C

In [32]:
cizgiFilmDataFrame.loc["Simpson","Bart"]

Yas       10
Meslek     B
Name: (Simpson, Bart), dtype: object

In [33]:
cizgiFilmDataFrame.index.names=["Film Adı","Isımler"]

In [34]:
cizgiFilmDataFrame

                   Yas Meslek
Film Adı   Isımler
Simpson    Hamer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [35]:
dısTaslak=["Meyve","Meyve","Meyve","Sebze","Sebze","Sebze"]
icTaslak=["Karpuz","Elma","Armut","Domates","Patlıcan","Biber"]

In [36]:
birlesim=list(zip(dısTaslak,icTaslak))

In [37]:
birlesim1=pd.MultiIndex.from_tuples(birlesim)

In [38]:
birlesim

[('Meyve', 'Karpuz'),
 ('Meyve', 'Elma'),
 ('Meyve', 'Armut'),
 ('Sebze', 'Domates'),
 ('Sebze', 'Patlıcan'),
 ('Sebze', 'Biber')]

In [39]:
kalori=[100,200,250,400,120,450]

In [40]:
sonuc=pd.DataFrame(kalori,index=birlesim1,columns=["Kalori"])

In [41]:
sonuc

                Kalori
Meyve Karpuz       100
      Elma         200
      Armut        250
Sebze Domates      400
      Patlıcan     120
      Biber        450

##

## Eksik Veriler

In [42]:
sozlukVerisi={"İstanbul":[30,20,np.nan],
             "Ankara":[40,np.nan,25],
              "İzmir":[40,39,38]             
             
             }

In [43]:
sozlukVerisi

{'İstanbul': [30, 20, nan], 'Ankara': [40, nan, 25], 'İzmir': [40, 39, 38]}

In [44]:
havaDataFrame=pd.DataFrame(sozlukVerisi,index=["Pazartesi","Salı","Çarşamba"])

In [45]:
havaDataFrame

           İstanbul  Ankara  İzmir
Pazartesi      30.0    40.0     40
Salı           20.0     NaN     39
Çarşamba        NaN    25.0     38

In [46]:
havaDataFrame.dropna()

           İstanbul  Ankara  İzmir
Pazartesi      30.0    40.0     40

In [47]:
havaDataFrame.dropna(axis=1)

           İzmir
Pazartesi     40
Salı          39
Çarşamba      38

In [48]:
adSoyadYas={"ad":["Ali","Ahmet","Mehmet"],
           "soyad":["Çağlayan",np.nan,"Demir"],
            "yas":[np.nan,45,np.nan]
      
           }

In [49]:
adSoyadYasDF=pd.DataFrame(adSoyadYas,index=["1.kişi","2.kişi","3.kişi"])

In [50]:
adSoyadYasDF

            ad     soyad   yas
1.kişi     Ali  Çağlayan   NaN
2.kişi   Ahmet       NaN  45.0
3.kişi  Mehmet     Demir   NaN

In [51]:
adSoyadYasDF.dropna()

Empty DataFrame
Columns: [ad, soyad, yas]
Index: []

In [59]:
adSoyadYasDF.dropna(axis=0,thresh=2)

            ad     soyad   yas
1.kişi     Ali  Çağlayan   NaN
2.kişi   Ahmet       NaN  45.0
3.kişi  Mehmet     Demir   NaN

In [58]:
adSoyadYasDF.dropna(axis=0,thresh=2)

            ad     soyad   yas
1.kişi     Ali  Çağlayan   NaN
2.kişi   Ahmet       NaN  45.0
3.kişi  Mehmet     Demir   NaN

In [60]:
adSoyadYasDF.fillna(200)

            ad     soyad    yas
1.kişi     Ali  Çağlayan  200.0
2.kişi   Ahmet       200   45.0
3.kişi  Mehmet     Demir  200.0

In [61]:
adSoyadYasDF

            ad     soyad   yas
1.kişi     Ali  Çağlayan   NaN
2.kişi   Ahmet       NaN  45.0
3.kişi  Mehmet     Demir   NaN

In [62]:
adSoyadYasDF.fillna(12)

            ad     soyad   yas
1.kişi     Ali  Çağlayan  12.0
2.kişi   Ahmet        12  45.0
3.kişi  Mehmet     Demir  12.0

##

## Groupby

In [64]:
calisanSozluk={
    "Departman":["Yazılım","Yazılım","Muhasebe","Hukuk","Hukuk"],
    "Calisan Ismi":["Ali","Ahmet","Zeynep","Hakan","Can"],
     "Maas":[50000,45000,3000,40000,40000]    
    
    
}

In [65]:
calisanSozlukDF=pd.DataFrame(calisanSozluk)

In [66]:
calisanSozlukDF

  Departman Calisan Ismi   Maas
0   Yazılım          Ali  50000
1   Yazılım        Ahmet  45000
2  Muhasebe       Zeynep   3000
3     Hukuk        Hakan  40000
4     Hukuk          Can  40000

In [67]:
## Burda groupby() parentez içine neye göre gruplandırmak istediğimi yazmalıyım!

gruplandırma=calisanSozlukDF.groupby("Departman")

In [68]:
gruplandırma

In [69]:
gruplandırma.count()

           Calisan Ismi  Maas
Departman
Hukuk                 2     2
Muhasebe              1     1
Yazılım               2     2

In [70]:
gruplandırma.mean()

C:\Users\Sude\AppData\Local\Temp\ipykernel_18356\1940157767.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  gruplandırma.mean()

              Maas
Departman
Hukuk      40000.0
Muhasebe    3000.0
Yazılım    47500.0

In [71]:
gruplandırma.max()

          Calisan Ismi   Maas
Departman
Hukuk            Hakan  40000
Muhasebe        Zeynep   3000
Yazılım            Ali  50000

In [72]:
gruplandırma.min()

          Calisan Ismi   Maas
Departman
Hukuk              Can  40000
Muhasebe        Zeynep   3000
Yazılım          Ahmet  45000

In [73]:
gruplandırma.describe()

           Maas                                                            \
          count     mean          std      min      25%      50%      75%
Departman
Hukuk       2.0  40000.0     0.000000  40000.0  40000.0  40000.0  40000.0
Muhasebe    1.0   3000.0          NaN   3000.0   3000.0   3000.0   3000.0
Yazılım     2.0  47500.0  3535.533906  45000.0  46250.0  47500.0  48750.0


               max
Departman
Hukuk      40000.0
Muhasebe    3000.0
Yazılım    50000.0

##

## Concat

In [75]:
sozluk1={
    "isim":["Ali","Ahmet","Mehmet"],
    "Spor":["Kayak","Yüzme","Basketbol"],
     "Kalori":[100,200,300]    
    
    }

In [77]:
sozluk2={
    "isim":["Zeynep","Nil","Gamze"],
    "Spor":["Kayak","Yüzme","Basketbol"],
     "Kalori":[100,200,300]    
    
    }

In [78]:
sozluk3={
    "isim":["Nalan","Nazmi","Canan"],
    "Spor":["Kayak","Yüzme","Basketbol"],
     "Kalori":[100,200,300]    
    
    }

In [84]:
dataFrame1=pd.DataFrame(sozluk1,index=[1,2,3])
dataFrame2=pd.DataFrame(sozluk2,index=[4,5,6])
dataFrame3=pd.DataFrame(sozluk3,index=[7,8,9])

In [85]:
dataFrame1

     isim       Spor  Kalori
1  Zeynep      Kayak     100
2     Nil      Yüzme     200
3   Gamze  Basketbol     300

In [86]:
dataFrame2

     isim       Spor  Kalori
4  Zeynep      Kayak     100
5     Nil      Yüzme     200
6   Gamze  Basketbol     300

In [87]:
dataFrame3

    isim       Spor  Kalori
7  Nalan      Kayak     100
8  Nazmi      Yüzme     200
9  Canan  Basketbol     300

In [89]:
pd.concat([dataFrame1,dataFrame2,dataFrame3],axis=1)

,isim,Spor,Kalori,isim,Spor,Kalori,isim,Spor,Kalori
1,Zeynep,Kayak,100.0,NaN,NaN,NaN,NaN,NaN,NaN
2,Nil,Yüzme,200.0,NaN,NaN,NaN,NaN,NaN,NaN
3,Gamze,Basketbol,300.0,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,Zeynep,Kayak,100.0,NaN,NaN,NaN
5,NaN,NaN,NaN,Nil,Yüzme,200.0,NaN,NaN,NaN
6,NaN,NaN,NaN,Gamze,Basketbol,300.0,NaN,NaN,NaN
7,NaN,NaN,NaN,NaN,NaN,NaN,Nalan,Kayak,100.0
8,NaN,NaN,NaN,NaN,NaN,NaN,Nazmi,Yüzme,200.0
9,NaN,NaN,NaN,NaN,NaN,NaN,Canan,Basketbol,300.0

In [90]:
pd.concat([dataFrame1,dataFrame2,dataFrame3])

     isim       Spor  Kalori
1  Zeynep      Kayak     100
2     Nil      Yüzme     200
3   Gamze  Basketbol     300
4  Zeynep      Kayak     100
5     Nil      Yüzme     200
6   Gamze  Basketbol     300
7   Nalan      Kayak     100
8   Nazmi      Yüzme     200
9   Canan  Basketbol     300

##

## Merge(Kaynaştırmak)

In [92]:
## Bunu şöyle düşünebilirsin 2 tane tablon var ve tablolarında ortak bir kolon var tablolarını 
#  o kolona göre birleştirip tek kolon haline getirebilirsin.

In [93]:
adSoyadSozluk={
    "ad":["ALi","Ahmet","Ayşe"],
    "soyad":["Kale","Demir","Sal"]
    
    
}

In [109]:
adYasSozluk={
     "ad":["ALi","Ahmet","Ayşe"],
     "yas":[25,22,21]
    
}

In [110]:
adSoyadDF=pd.DataFrame(adSoyadSozluk)
adYasSozlukDF=pd.DataFrame(adYasSozluk)

In [111]:
## "on"'un eişttirden sonraki kısmına ortak kolon adı yazılır.

pd.merge(adSoyadDF,adYasSozlukDF,on="ad")

      ad  soyad  yas
0    ALi   Kale   25
1  Ahmet  Demir   22
2   Ayşe    Sal   21